<template>
  <div class="qw-serviceAgreement-box" v-if="show">
    <div class="qw-serviceAgreement">
      <div class="title">企业账户服务协议</div>
      <div class="text">
        <p style="margin:20px 0;">企微企业账户服务协议（以下简称本协议）由广东道一信息技术股份有限公司（以下简称企微）与你签订。</p>
        <p style="margin:10px 0;"><strong>一、声明与承诺</strong></p>
        <p><strong>1.1  在接受本协议或你以本公司允许的其他方式实际使用企微企业账户服务之前，请你仔细阅读本协议的全部内容（特别是以粗体标注的内容）。如果你不同意本协议的任意内容，或者无法准确理解本公司对条款的解释，请不要进行后续操作，包括但不限于不要接受本协议，不使用本服务。如果你对本协议的条款有疑问，请通过本公司客服渠道进行询问，本公司将向你解释条款内容。</strong></p>
        <p><strong>1.2  你同意，如本公司需要对本协议进行变更或修改的，须通过http://wbg.do1.com.cn/网站公告的方式提前予以公布，公告期限届满后即时生效；若你在本协议内容公告变更生效后继续使用企微企业账户服务的，表示你已充分阅读、理解并接受变更后的协议内容，也将遵循变更后的协议内容使用企微企业账户服务；若你不同意变更后的协议内容，你应在变更生效前停止使用本服务。</strong></p>
        <p style="margin:10px 0;"><strong>二、服务内容</strong></p>
        <p>企微企业账户是隶属道一云|企微下的服务，通过企业账户，为企业提供充值、交易管理、统一的服务购买支付、退款、提现等支付工具功能，将企微旗下的产品服务、合作商户提供的服务与入驻企业进行直接链接，为企业提供各种企业应用场景下的服务能力。</p>
        <p style="margin:10px 0;"><strong>三、企微企业账户的权利与义务</strong></p>
        <p><strong>3.1  账户系统建设</strong> 企微负责企业账户系统的建设、运行和管理，并确保该系统的安全性。</p>
        <p><strong>3.2  信息安全 </strong>企微保障你的所有支付账号、密码等信息安全，并保障所有交易记录的安全性。</p>
        <p><strong>3.3  延迟结算</strong> 企微企业账户发现你可能存在洗钱、恐怖融资、欺诈交易、信用卡套现、恶意倒闭或其他违法违规行为，企微可以对你账户中的相应资金进行延迟结算。你的行为导致企微遭受损失的，你还应当承担赔偿责任。</p>
        <p><strong>3.4  身份验证和授权</strong> 你使用本服务，即表明你同意企微企业账户收集、记录和使用企业使用本服务过程中产生的相关信息和数据，包括但不限于企业的身份信息、账户信息和交易信息等。企微有权将前述信息提交国家机关和金融机构进行身份验证和鉴权，同时，为更好地提供服务，企微及关联公司有权在法律允许的范围内自行收集、记录、使用上述信息和数据。</p>
        <p style="margin:10px 0;"><strong>四、企业的权利与义务</strong></p>
        <p><strong>4.1  账号保管 </strong>你应该妥善保管企微企业账户的账号密码等登录信息，企业账户下的一切行为均视为你企业的行为。</p>
        <p><strong>4.2  真实交易背景 </strong>你承诺发起的本服务交易基于真实的交易，不得利用本服务从事虚假交易。</p>
        <p><strong>4.3  反套现、反洗钱</strong> 你不得进行信用卡套现、洗钱、交易分单等违法经营行为，不得出现虚假申请、恶意倒闭等严重风险行为，否则，企微有权暂停或终止提供本协议服务，并将你的企业信息报送至中国人民银行和公安部及相关监管机构。</p>
        <p style="margin:10px 0;"><strong>五、交易结算</strong></p>
        <p><strong>5.1  充值</strong> 使用企业服务时，需要使用账户余额进行交易。企业可通过网银或线下转账的方式进行充值，其中网银充值可以通过个人网银账户或企业网银账户充值。</p>
        <p><strong>5.2  提现</strong> 当你由于自身原因需要提现时，可提交提现申请。提现必须绑定企业对公账户，提现申请提交成功后，冻结账户中对应的款项，转由企微工作人员在每个工作日集中处理企业的提现申请，转账到企业的银行账户中。</p>
        <p><strong>5.3  开发票 </strong>你可以对充值交易申请开普通发票或增值税发票，企微工作人员进行审核，通过后向你的企业寄送发票，你可以实时查询发票申请结果，只有当可开票金额大于1000时，才允许申请开发票。</p>
        <p><strong>5.4  对账 </strong>企微提供所有的交易明细，你与企微对账数据不一致的，以企微企业账户数据为准。</p>
        <p><strong>5.5  滴滴出行 </strong>你在使用本服务时同意并认可已自行查阅过滴滴行车价目表，并同意按照行程支付页面的结算金额支付行车服务费。如你对该次出行的一切费用有异议，可于费用发生之日3个自然日内向“滴滴出行”平台反映，否则视为该等费用不存在争议。</p>
        <p style="margin:10px 0;"><strong>六、服务使用最低余额要求</strong></p>
        <p><strong>在使用某些特定服务时，企微要求你企业账户中的余额大于一定数额，才可以使用该服务，以防止你的企业账户透支。具体数额以该项服务的说明为准。</strong></p>
        <p style="margin:10px 0;"><strong>七、保密条款</strong></p>
        <p>7.1 除本协议另有约定外，未经一方书面同意，任何一方不得将本协议内容、用户个人信息、支付信息以及接口技术、安全协议及证书等透露给无关第三方。</p>
        <p><strong>7.2 各方对在履行协议中获得的商业机密和技术秘密负保密责任。出现下列任一情况时，企微有权披露你企业的相关商业信息：</strong></p>
        <p><strong>（1）人民银行或银监会、证监会、保监会等金融业监管机构要求企微提供企业的相关商业信息的；</strong></p>
        <p><strong>（2）公安机关、人民法院、人民检察院或有权行政机关要求企微提供企业的相关商业信息的；</strong></p>
        <p><strong>本协议所称商业信息包括但不限于你的交易单号、交易凭证、资金流水等交易信息。</strong></p>
        <p><strong>7.3 企微有权把你的相关信息提供给与企微合作的第三方服务，以保证第三方服务正常使用。</strong></p>
        <p>7.4 各方保证其雇员及代理人履行本条的保密义务。</p>
        <p>7.5 上述保密义务在本协议终止后五年内有效。</p>
        <p style="margin:10px 0;"><strong>八、交易风险要求</strong></p>
        <p>8.1 在使用本服务时，若你不遵从本协议或相关网站说明、交易、支付页面中的操作提示、规则，则本公司有权拒绝为你的企业提供相关服务，且本公司不承担损害赔偿责任。<strong> 若发生上述状况，而款项已先行划付至企业账户名下，你同意本公司有权直接自相关账户中扣回相应款项及（或）禁止你要求支付此笔款项之权利。此款项若已汇入你的银行账户，你同意本公司有向你事后索回之权利，因你的原因导致本公司事后追索的，你应当承担本公司合理的追索费用。</strong></p>
        <p><strong>8.2 因你的过错导致的任何损失由你自行承担，该过错包括但不限于：不按照交易、支付提示操作，未及时进行交易操作，遗忘或泄漏密码，密码被他人破解，你使用的计算机被他人侵入。</strong></p>
        <p>8.3 你使用本服务时同意并认可，可能由于银行本身系统问题、银行相关作业网络连线问题、任何互联网系统问题或网络运营商原因、你的电子邮件系统问题或邮件服务商原因、你的手机通讯系统问题或通讯服务商原因或其他不可抗拒因素，造成本服务无法提供，对此本公司不承担任何责任。</p>
        <p style="margin:10px 0;"><strong>九、免责条款</strong></p>
        <p>9.1  系统中断或故障</p>
        <p>本公司系统因下列状况无法正常运作，使你无法使用各项服务时，本公司不承担损害赔偿责任，该状况包括但不限于：</p>
        <p>（一）本公司在本网站公告之系统停机维护期间。</p>
        <p>（二）电信设备出现故障不能进行数据传输的。</p>
        <p>（三）因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成本公司系统障碍不能执行业务的。</p>
        <p>（四）由于黑客攻击、电信部门技术调整或故障、网站升级、银行方面的问题等原因而造成的服务中断或者延迟。</p>
        <p>9.2  任何企微之外的第三方机构或个人所提供的服务，其服务品质及内容由该第三方自行、独立负责。会员享用相关服务时产生的争议、纠纷及损失，企微不承担任何责任。</p>
        <p style="margin:10px 0;"><strong>十、法律适用与管辖</strong></p>
        <p><strong>本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。因本协议产生之争议，均应依照中华人民共和国法律予以处理，并由被告住所地人民法院管辖。</strong></p>
        <p> </p>
        <p></p>
        <p></p>
        <p></p>
      </div>
      <div class="btn">
        <button @click="closeClick">关闭</button>
      </div>
    </div>
  </div>

  </div>
</template>

<script type="text/javascript">
  export default {
    name: 'serviceAgreement',
    props: {
      //显示内容
      show:{
        type:Boolean,
        required:true,
        default:false,
      },
    },
    data() {
      return {

      }
    },
    methods:{
      closeClick(){
        this.$emit("update:show",false);
      }
    }
  }
</script>

<style lang="scss" scoped>
  .qw-serviceAgreement-box{
    position: fixed;
    top: 0;
    bottom: 0;
    left: 0;
    right:0;
    z-index:3;
    overflow: hidden;
    background-color: rgba(0, 0, 0, 0.65);
    height: 100%;
    z-index: 1000;
    filter: alpha(opacity=50);
    .qw-serviceAgreement{
      width: 80%;
      position: absolute;
      left: 50%;
      top: 50%;
      -webkit-transform: translate(-50%, -50%);
      transform: translate(-50%, -50%);
      padding: 40px 40px 0 40px;
      background: #fff;
    .title{
      position: absolute;
      top: 40px;
      left: 40px;
      right: 40px;
      height: 50px;
      line-height: 50px;
      text-align: center;
      background: #ececec;
      font-size: 16px;
    }
    .text{
      height: 534px;
      max-height: 534px;
      margin-top: 52px;
      font-size: 14px;
      overflow-y: scroll;
    }
      .btn{
        text-align: center;
        padding:30px 0;
        button{
          padding: 5px 20px;
          font-size: 14px;
          line-height: 20px;
          -webkit-border-radius: 4px;
          border-radius: 4px;
          color: #333333;
          background-color: #fff;
          border: 1px solid #cccccc;
          cursor: pointer;
        }
      }
    }

  }
</style>
